worlderest/test/s1/s2/s3/s4/s5/BLE_p2pClient (1)/STM32_WPAN/App/gatt_client_app.c
        LOG_INFO_APP("    UUID=0x%04X, handle=0x%04X", uuid, handle);

        if (uuid == DEVICE_NAME_UUID)
        {
          LOG_INFO_APP(", found GAP DEVICE_NAME_UUID\n");
        }
        else if (uuid == APPEARANCE_UUID)
        {
          LOG_INFO_APP(", found GAP APPEARANCE_UUID\n");
        }
        else if (uuid == SERVICE_CHANGED_CHARACTERISTIC_UUID)
        {
          LOG_INFO_APP(", found GATT SERVICE_CHANGED_CHARACTERISTIC_UUID\n");
        }
/* USER CODE BEGIN gatt_parse_descs_2 */
        else if (uuid == ST_P2P_WRITE_CHAR_UUID)
        {
          LOG_INFO_APP(", found ST_P2P_WRITE_CHAR_UUID\n");
        }
        else if (uuid == ST_P2P_NOTIFY_CHAR_UUID)
        {
          LOG_INFO_APP(", found ST_P2P_NOTIFY_CHAR_UUID\n");
        }

/* USER CODE END gatt_parse_descs_2 */
        else
        {
          LOG_INFO_APP("\n");
        }
      }
    uuid_offset += handle_uuid_pair_size;
    }
  }
  else
  {
    LOG_INFO_APP("ACI_ATT_FIND_INFO_RESP_VSEVT_CODE, failed handle not found in connection table !\n");
  }

  return;
}

static int gatt_parse_notification(aci_gatt_notification_event_rp0 *p_evt)
{
  int ret = -1;

  LOG_DEBUG_APP("ACI_GATT_NOTIFICATION_VSEVT_CODE - ConnHdl=0x%04X, Attribute_Handle=0x%04X\n",
                p_evt->Connection_Handle,
                p_evt->Attribute_Handle);
/* USER CODE BEGIN gatt_parse_notification_1 */
  // GATT_CLIENT_APP_Notification_evt_t Notification;
  // uint8_t index;

  // for (index = 0 ; index < CFG_BLE_NUM_CLIENT_CONTEXTS ; index++)
  // {
  //   if (a_ClientContext[index].connHdl == p_evt->Connection_Handle)
  //   {
  //     break;
  //   }
  // }

  // /* index < CFG_BLE_NUM_CLIENT_CONTEXTS means connection handle identified */
  // if (index < CFG_BLE_NUM_CLIENT_CONTEXTS)
  // {
  //   if (p_evt->Attribute_Handle == a_ClientContext[index].P2PNotificationValueHdl)
  //   {
  //     LOG_INFO_APP("  Incoming Nofification received P2P Server information\n");
  //     Notification.Client_Evt_Opcode = P2P_NOTIFICATION_INFO_RECEIVED_EVT;
  //     Notification.DataTransfered.length = p_evt->Attribute_Value_Length;
  //     Notification.DataTransfered.p_Payload = &p_evt->Attribute_Value[0];

  //     gatt_Notification(&Notification);
  //   }
  // }
  // else
  // {
  //   LOG_INFO_APP("ACI_GATT_NOTIFICATION_VSEVT_CODE, failed handle not found in connection table !\n");
  // }
  GATT_CLIENT_APP_Notification_evt_t Notification;
  uint8_t index;

  for (index = 0 ; index < CFG_BLE_NUM_CLIENT_CONTEXTS ; index++)
  {
    if (a_ClientContext[index].connHdl == p_evt->Connection_Handle)
    {
      break;
    }
  }

  /* index < CFG_BLE_NUM_CLIENT_CONTEXTS means connection handle identified */
  if (index < CFG_BLE_NUM_CLIENT_CONTEXTS)
  {
    // === 判断：是不是 ESP32 通过 FFA2 疯狂推流发过来的数据？ ===
    if (p_evt->Attribute_Handle == a_ClientContext[index].P2PNotificationValueHdl)
    {
//       LOG_INFO_APP("  >> Captured ESP32 , length: %d Byte\r\n", p_evt->Attribute_Value_Length);
      
      // 1. 提取指针和长度
      uint8_t *payload = &p_evt->Attribute_Value[0];
      uint8_t payload_len = p_evt->Attribute_Value_Length;
      
      // 2. 契约校验：检查帧头 0xAA 和长度 16
      if(payload_len == 16 && payload[0] == 0xAA)
      {
          // 架构师的防御性编程：必须使用 static，保证函数退出后内存依然有效
          static uint8_t safe_tx_buffer[16];
          
//          // 架构师的防踩踏机制：检查上一次 DMA 是否搬运完毕！
//          // 如果串口极慢，而蓝牙极快，下一次 Notify 到来时 DMA 还没发完，强行覆盖会导致错包
//          if (huart1.gState == HAL_UART_STATE_READY) 
//          {
//              // 1. 火速将底层易失性内存拷贝到安全的静态缓冲区
//              memcpy(safe_tx_buffer, payload, 16);
//              
//              // 2. 扣动扳机，让 DMA 硬件去搬运安全区的数据，CPU 拍拍屁股走人
//               HAL_UART_Transmit_DMA(&huart1, safe_tx_buffer, 16);
//              // 验证是我们的 16 字节契约数据包
//             if(payload_len == 16 && payload[0] == 0xAA)
//             {
//                 // 1. 光速将数据拷入安全屋
//				memcpy((uint8_t*)safe_rx_buffer, payload, 16);
//              
//          //     // 2. 按下呼叫铃！通知 Sequencer 大总管：“有新数据了，去跑解析任务！”
//				UTIL_SEQ_SetTask(1U << CFG_TASK_PARSE_IMU_ID, CFG_SEQ_PRIO_0);
//              
//          //     // 3. 极其迅速地退出回调，绝不卡住蓝牙底层！
//             }
//               LOG_INFO_APP("  >> [DMA Success] 16 Byte has been received (SEQ: %d)\r\n", (payload[3] << 8 | payload[2]));
//          }
//            else
//            {
//                // 触发此分支说明：上位机波特率太低，或者系统带宽已经到了物理极限！
//                 LOG_INFO_APP("  >> [DMA Warning] UART missed some data!(SEQ: %d)\r\n", (payload[3] << 8 | payload[2]));
//                // printf("X\n");
//                LOG_INFO_APP("X\n");
//            }

			memcpy((uint8_t*)safe_rx_buffer, payload, 16);
			UTIL_SEQ_SetTask(1U << CFG_TASK_PARSE_IMU_ID, CFG_SEQ_PRIO_0);
        }

      // 注释掉原本控制板载 LED 的逻辑，因为我们现在是收传感器数据
      /*
      Notification.Client_Evt_Opcode = P2P_NOTIFICATION_INFO_RECEIVED_EVT;
      Notification.DataTransfered.length = p_evt->Attribute_Value_Length;
      Notification.DataTransfered.p_Payload = &p_evt->Attribute_Value[0];

      gatt_Notification(&Notification);
      */
    }
  }
  else
  {
    LOG_INFO_APP("ACI_GATT_NOTIFICATION_VSEVT_CODE, failed handle not found in connection table !\n");
  }
/* USER CODE END gatt_parse_notification_1 */

  return ret;
}

static int gatt_parse_indication(aci_gatt_indication_event_rp0 *p_evt)
{
  int ret = -1;

  LOG_DEBUG_APP("ACI_GATT_CLT_INDICATION_VSEVT_CODE - ConnHdl=0x%04X, Attribute_Handle=0x%04X\n",
                p_evt->Connection_Handle,
                p_evt->Attribute_Handle);

  /* USER CODE BEGIN gatt_parse_indication_1 */

  /* USER CODE END gatt_parse_indication_1 */

  return ret;
}

static void client_discover_task(void)
{
  uint8_t index;

  for(index = 0; index < CFG_BLE_NUM_CLIENT_CONTEXTS; index++)
  {
    if(a_ClientContext[index].state == GATT_CLIENT_APP_DISCOVER_SERVICES)
    {
      a_ClientContext[index].state = GATT_CLIENT_APP_CONNECTED;

      /* USER CODE BEGIN client_discover_1 */

      /* USER CODE END client_discover_1 */

      GATT_CLIENT_APP_DiscoverServicesWithIndex(index);

      /* USER CODE BEGIN client_discover_2 */

      /* USER CODE END client_discover_2 */

      /* Check if in the meantime another server has been connected. */
      UTIL_SEQ_SetTask( 1U << CFG_TASK_DISCOVER_SERVICES_ID, CFG_SEQ_PRIO_0);

      break;
    }
  }

  return;
}

