worlderest/test/s1/s2/s3/s4/s5/BLE_p2pClient (1)/STM32_WPAN/App/gatt_client_app.c
static void gatt_cmd_resp_release(void)
{
  UTIL_SEQ_SetEvt(1U << CFG_EVENT_PROC_GATT_COMPLETE);
  return;
}

static uint8_t gatt_cmd_resp_wait(void)
{
  UTIL_SEQ_WaitEvt(1U << CFG_EVENT_PROC_GATT_COMPLETE);
  return procClientContext.gatt_error_code;
}

static uint8_t ReadLongCharacteristic(uint16_t connection_handle, uint16_t ValueHdl, uint16_t Offset)
{
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;

  LOG_INFO_APP("Read Long\n");

  procClientContext.gatt_error_code = 0;
  procClientContext.att_error_code = 0;

  /* Display Information characteristic */
  ret = aci_gatt_read_long_char_value(connection_handle,
                                      ValueHdl,
                                      Offset);
  if (ret != BLE_STATUS_SUCCESS || (ret = gatt_cmd_resp_wait()) != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("aci_gatt_read_long_char_value failed, connHdl=0x%04X, ValueHdl=0x%04X, ret = 0x%02X\n",
                connection_handle,
                ValueHdl,
                ret);
    return ret;
  }

  LOG_INFO_APP("aci_gatt_read_long_char_value, connHdl=0x%04X, ValueHdl=0x%04X\n",
              connection_handle,
              ValueHdl);

  return procClientContext.gatt_error_code;
}

tBleStatus GATT_CLIENT_APP_ReadCharacteristic(uint16_t connection_handle, uint16_t ValueHdl, uint16_t *data_length_p, uint8_t **data_p, uint8_t use_read_long)
{
  int index;
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;

  index = GATT_CLIENT_APP_Get_Index(connection_handle);
  if(index < 0)
    return ret;

  /* USER CODE BEGIN GATT_CLIENT_APP_ReadCharacteristic_1 */

  /* USER CODE END GATT_CLIENT_APP_ReadCharacteristic_1 */

  procClientContext.read_char_offset = 0;
  procClientContext.gatt_error_code = 0;
  procClientContext.att_error_code = 0;

  UTIL_SEQ_ClrEvt(1U << CFG_EVENT_PROC_GATT_COMPLETE);

  LOG_DEBUG_APP("aci_gatt_read_char_value, connHdl=0x%04X, ValueHdl=0x%04X\n",
                connection_handle,
                ValueHdl);

  ret = aci_gatt_read_char_value(connection_handle,
                                 ValueHdl);

  if (ret != BLE_STATUS_SUCCESS || (ret = gatt_cmd_resp_wait()) != BLE_STATUS_SUCCESS)
  {
    LOG_ERROR_APP("aci_gatt_read_char_value failed, connHdl=0x%04X, ValueHdl=0x%04X\n",
                connection_handle,
                ValueHdl);
    return ret;
  }

  if (use_read_long && procClientContext.read_char_len >= (a_ClientContext[index].att_mtu - 1))
  {
    ret = ReadLongCharacteristic(connection_handle, ValueHdl, procClientContext.read_char_len);
  }

  if(ret != BLE_STATUS_SUCCESS && procClientContext.att_error_code != 0x0B) /* 0x0B: Attribute not long */
  {
    *data_p = NULL;
    *data_length_p = 0;
  }
  else
  {
    *data_p = procClientContext.read_char;
    *data_length_p = procClientContext.read_char_len;
  }

  /* USER CODE BEGIN GATT_CLIENT_APP_ReadCharacteristic_2 */

  /* USER CODE END GATT_CLIENT_APP_ReadCharacteristic_2 */

  return ret;
}

tBleStatus GATT_CLIENT_APP_WriteCharacteristic(uint16_t connection_handle, uint16_t ValueHdl, uint16_t data_length, uint8_t *data)
{
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;

  /* USER CODE BEGIN GATT_CLIENT_APP_WriteCharacteristic_1 */

  /* USER CODE END GATT_CLIENT_APP_WriteCharacteristic_1 */

  procClientContext.gatt_error_code = 0;
  procClientContext.att_error_code = 0;

  UTIL_SEQ_ClrEvt(1U << CFG_EVENT_PROC_GATT_COMPLETE);

  ret = aci_gatt_write_char_value(connection_handle,
                                  ValueHdl,
                                  data_length,
                                  data);
  if (ret != BLE_STATUS_SUCCESS)
  {
    LOG_ERROR_APP("aci_gatt_write_char_value failed, connHdl=0x%04X, ValueHdl=0x%04X\n",
                  connection_handle,
                  ValueHdl);
    return ret;
  }
  else
  {
    LOG_DEBUG_APP("aci_gatt_write_char_value, connHdl=0x%04X, ValueHdl=0x%04X\n",
                  connection_handle,
                  ValueHdl);
  }
  /* wait until a gatt procedure complete is received */
  gatt_cmd_resp_wait();

  /* USER CODE BEGIN GATT_CLIENT_APP_WriteCharacteristic_2 */

  /* USER CODE END GATT_CLIENT_APP_WriteCharacteristic_2 */

  return procClientContext.gatt_error_code;
}

/* USER CODE BEGIN LF */

// static void P2Pclient_write_char(void)
// {
//   uint8_t index = 0;
//   tBleStatus ret;

//   if (P2PButtonData.level == 0x00)
//   {
//     P2PButtonData.level = 0x01;
//   }
//   else
//   {
//     P2PButtonData.level = 0x00;
//   }

//   for(index = 0; index < CFG_BLE_NUM_CLIENT_CONTEXTS; index++)
//   {
//     if (a_ClientContext[index].state == GATT_CLIENT_APP_CONNECTED)
//     {
//       ret = aci_gatt_write_without_resp(a_ClientContext[index].connHdl,
//                                         a_ClientContext[index].P2PWriteToServerValueHdl,
//                                         2,
//                                         (uint8_t *)&P2PButtonData);

//       if (ret != BLE_STATUS_SUCCESS)
//       {
//         LOG_INFO_APP("aci_gatt_write_without_resp failed, connHdl=0x%04X, ValueHdl=0x%04X\n",
//                 a_ClientContext[index].connHdl,
//                 a_ClientContext[index].P2PWriteToServerValueHdl);
//       }
//       else
//       {
//         LOG_INFO_APP("aci_gatt_write_without_resp success, connHdl=0x%04X, ValueHdl=0x%04X\n",
//           a_ClientContext[index].connHdl,
//           a_ClientContext[index].P2PWriteToServerValueHdl);
//       }
//     }
//   }

//   return;
// }

static void P2Pclient_write_char(void)
{
  uint8_t index = 0;
  tBleStatus ret;
  
  // 1. 定义一个静态变量来记住当前的状态 (代替原有的 P2PButtonData)
  static uint8_t cmd_value = 0x00; 

  // 2. 状态机翻转 (0x01 启动推流, 0x00 停止推流)
  if (cmd_value == 0x00)
  {
    cmd_value = 0x01;
  }
  else
  {
    cmd_value = 0x00;
  }

  // 3. 遍历连接的设备并发送
  for(index = 0; index < CFG_BLE_NUM_CLIENT_CONTEXTS; index++)
  {
    if (a_ClientContext[index].state == GATT_CLIENT_APP_CONNECTED)
    {
      // 【重点修改】发送长度改为 1 字节，直接发送 cmd_value 的地址
      ret = aci_gatt_write_without_resp(a_ClientContext[index].connHdl,
                                        a_ClientContext[index].P2PWriteToServerValueHdl,
                                        1, 
                                        &cmd_value);

      if (ret != BLE_STATUS_SUCCESS)
      {
//        LOG_INFO_APP(">> send failed!!!! connHdl=0x%04X, ValueHdl=0x%04X\n",
//                a_ClientContext[index].connHdl,
//                a_ClientContext[index].P2PWriteToServerValueHdl);
		  LOG_INFO_APP(">> Fail to send! Error Code: 0x%02X, connHdl: 0x%04X, Handle: 0x%04X\n", 
                  ret, 
                  a_ClientContext[index].connHdl, 
                  a_ClientContext[index].P2PWriteToServerValueHdl);
      }
      else
      {
        // 【重点修改】把真实发出去的指令值打印出来！
        LOG_INFO_APP(">> SUCCEED TO SEND: 0x%02X\r\n", cmd_value);
      }
    }
  }

  return;
}

void My_IMU_Math_Task(void)
{
    // 1. 直接把暂存柜里的数据，扔给我们的独立模块去解析！
    IMU_Parse_Data(safe_rx_buffer);

	memset(safe_rx_buffer, 0, sizeof(safe_rx_buffer));
    // 2. 解析完了？我们可以拿出来看看成果
    float* my_acc = IMU_Get_Acc();
    float* my_gyro = IMU_Get_Gyro();
    
	gyro_Calibration(my_gyro,my_gyro+1,my_gyro+2);
	gyro_DeadZone_execute(my_gyro,my_gyro+1,my_gyro+2);
	
    // (可选) 你可以用原厂的 LOG 打印一下 Z 轴加速度，看看是不是在 1.0g 附近
    // 注意：用 %f 打印浮点数可能需要在 IDE 里开启 printf float 支持
	  LOG_INFO_APP("\r\n--- IMU DATA ---\r\n");
	
      LOG_INFO_APP("Acc X: %.5f g\r\n", my_acc[0]);
      LOG_INFO_APP("Acc Y: %.5f g\r\n", my_acc[1]);
      LOG_INFO_APP("Acc Z: %.5f g\r\n", my_acc[2]);
      LOG_INFO_APP("Gyro X: %.5f dps\r\n", my_gyro[0]);
      LOG_INFO_APP("Gyro Y: %.5f dps\r\n", my_gyro[1]);
      LOG_INFO_APP("Gyro Z: %.5f dps\r\n", my_gyro[2]);
	  LOG_INFO_APP("Mag of Acc: %.5f g \r\n",sqrtf(my_acc[0]*my_acc[0]+my_acc[1]*my_acc[1]+my_acc[2]*my_acc[2]));
	  LOG_INFO_APP("Mag of Gyro: %.5f dps \r\n",sqrtf(my_gyro[0]*my_gyro[0]+my_gyro[1]*my_gyro[1]+my_gyro[2]*my_gyro[2]));


}
/* USER CODE END LF */
